Repository: x0c/TextSnap
Catalog: TextSnap/Localizable.xcstrings
Source language: en
Languages: zh_hans

# alert.ok
source: OK
zh_hans: 好

# about.credits
source: TextSnap: press a shortcut, box a region, text lands in the clipboard.
zh_hans: TextSnap：按快捷键框选屏幕，文字直接进入剪贴板。

# hotkey.key.space
source: Space
zh_hans: 空格

# hotkey.key.unknown
source: Key
zh_hans: 按键

# settings.title
source: TextSnap Settings
zh_hans: TextSnap 设置

# settings.version.label
source: Version
zh_hans: 版本

# status.item.accessibility
source: TextSnap: capture screen text
zh_hans: TextSnap：识别屏幕文字

# menu.captureNow
source: Capture Text Now
zh_hans: 立即识别

# menu.settings
source: Settings…
zh_hans: 设置…

# menu.launchAtLogin
source: Launch at Login
zh_hans: 开机自启动

# menu.checkForUpdates
source: Check for Updates…
zh_hans: 检查更新…

# menu.about
source: About TextSnap
zh_hans: 关于 TextSnap

# menu.quit
source: Quit TextSnap
zh_hans: 退出 TextSnap

# settings.hotkey.section
source: Shortcut
zh_hans: 快捷键

# settings.hotkey.hint
source: Press Record, then press the new combination. Factory default is ⌘⇧2.
zh_hans: 点“录制”，再按新组合键。出厂默认 ⌘⇧2。

# settings.hotkey.recordingHint
source: Press the new combination… (Esc cancels)
zh_hans: 请按新组合键……（Esc 取消）

# settings.hotkey.record
source: Record
zh_hans: 录制

# settings.hotkey.recording
source: Recording…
zh_hans: 录制中…

# settings.hotkey.clear
source: Clear
zh_hans: 清除

# settings.hotkey.restore
source: Restore Default
zh_hans: 恢复默认

# settings.hotkey.cleared
source: Cleared
zh_hans: 已清除

# settings.hotkey.current
source: Current shortcut
zh_hans: 当前快捷键

# settings.hotkey.needModifier
source: A shortcut needs at least one modifier key.
zh_hans: 快捷键至少要带一个修饰键。

# settings.hotkey.reserved
source: That combination is reserved by the system.
zh_hans: 该组合被系统占用。

# settings.hotkey.taken
source: That combination is already taken.
zh_hans: 该组合已被占用。

# settings.hotkey.initFailed
source: Could not listen for the shortcut.
zh_hans: 无法监听快捷键。

# settings.permission.section
source: Screen Recording
zh_hans: 屏幕录制

# settings.permission.granted
source: Permission granted
zh_hans: 已获得授权

# settings.permission.openSettings
source: Open System Settings
zh_hans: 打开系统设置

# settings.permission.hint
source: First capture asks once in a system dialog. If denied, allow TextSnap here and come back — it works right away. If you turned the switch off and back on, relaunch TextSnap first.
zh_hans: 首次识别会弹一次系统授权窗。若拒绝，在此允许 TextSnap 后回来即刻可用。若曾关闭后重新打开开关，需先重启 TextSnap。

# settings.launchAtLogin.section
source: Launch
zh_hans: 启动

# settings.launchAtLogin.toggle
source: Launch at Login
zh_hans: 开机自启动

# settings.launchAtLogin.needsApproval
source: macOS is waiting for your approval in Login Items.
zh_hans: 系统正在登录项中等你批准。

# settings.launchAtLogin.openSettings
source: Open Login Items
zh_hans: 打开登录项

# settings.launchAtLogin.failed
source: Could not change the login item.
zh_hans: 无法修改登录项。

# settings.lastResult.section
source: Last Result
zh_hans: 上次结果

# settings.lastResult.empty
source: Nothing recognized yet. Press ⌘⇧2 and drag a region.
zh_hans: 还没有识别结果。按 ⌘⇧2 框选一块屏幕。

# settings.lastResult.copyAgain
source: Copy Again
zh_hans: 再复制一次

# settings.actions.section
source: Actions
zh_hans: 操作

# permission.denied.title
source: Screen recording is off
zh_hans: 屏幕录制未打开

# permission.denied.body
source: TextSnap cannot see the region you select until you allow it under Privacy & Security → Screen & System Audio Recording.
zh_hans: 在“隐私与安全性 → 屏幕与系统音频录制”里允许 TextSnap 之前，它看不到你框选的区域。

# permission.openSettings
source: Open System Settings
zh_hans: 打开系统设置

# capture.failed.title
source: Could not read that region
zh_hans: 没能读取这块区域

# capture.failed.body
source: The capture or recognition failed. Try again with a larger, sharper region.
zh_hans: 截图或识别失败。换一块更大更清晰的区域再试。

# capture.empty.title
source: No text found
zh_hans: 没找到文字

# capture.empty.body
source: Nothing readable in that region. Try a larger region with sharper text.
zh_hans: 这块区域里没有可读文字。换一块更大、字更清晰的区域。

# intent.capture.title
source: Capture Screen Text
zh_hans: 识别屏幕文字

# intent.capture.description
source: Capture a screen region and copy its text to the clipboard.
zh_hans: 框选一块屏幕区域，把其中的文字拷入剪贴板。
